Revit 2027 API
FilterStringRule.GetEvaluator Method
 Gets the evaluator that implements the test for this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilterStringRuleEvaluator GetEvaluator()
Public Function GetEvaluator As FilterStringRuleEvaluator
public:
FilterStringRuleEvaluator^ GetEvaluator()
member GetEvaluator : unit -> FilterStringRuleEvaluator
Return Value
FilterStringRuleEvaluator
See Also
Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace